// todo work with terminal //
// ! ctrl + ` - вызов терменала в VSC

// ? pwd - команда отображающая путь к файлу в котором вы находитесь

// ? clear (ctrl + l) - очищает терменал

// ? ls - отображает текущий файл
// * ls -l - информация как список всех файлов текущей папки
// * ls -la - информация как список всех файлов текущей папки, в том числе и скрытых файлов
// * ls [путь папки] - информация о том, что за файлы в папке, путь к которой был прописан

// ? cd - команда навигации. путь к файлам прописывается так же как и в CSS
// * cd .. - выходит из папки на один уровень выше

// ? touch - создание файлов
// * mv - переименование файлов: mv [название файла который надо переименовать] [новое имя файла]
// * rm - удаление файлов (не удаляет папки)
// * rm -rf [путь] -удаляет репозиторий и все что внутри него
// * mkdir - создание папок




// ! Work with node and npm //
// ! КОД НАПИСАННЫЙ С ПОМОЩЬЮ ПАКЕТОВ npm В БРАУЗЕРЕ РАБОТАТЬ НЕ БУДЕТ !!!

// ? node - вход в node
// ? node [имя файла] - запускает код в терменале
// * node -v - проверить версию node

// ? npm init - инициализация npm в проекте (репозитории?)
// ! npm run dev - включает локальный сервер
// ! ctrl + c - выход из режима сервера
// todo npmjs.com - сайт со всеми нужными библиотеками для npm
// todo в .gitignore - нужно добавить запись позволяющую игнорировать пакеты npm - node_modules/
// ? npm install / npm i [имя пакета] - установка библиотеки через npm
// ? npm uninstall [имя пакета] - удаление библиотеки через npm

// ? require("имя") - позволяет импортировать пакет из локального репозитория в текущий файл

// ? pre и post





